indoor/app/layout/resource/resource/onvif/post_onvif_imaging_set_imaging_setting.xml

POST /onvif/imaging HTTP/1.1
Content-Type: application/soap+xml; charset=utf-8;
action="http://www.onvif.org/ver20/imaging/wsdl/SetImagingSettings"
Host: %s
%sContent-Length: %d
Accept-Encoding: gzip, deflate
Connection: Close

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  %s<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <SetImagingSettings xmlns="http://www.onvif.org/ver20/imaging/wsdl">
      <VideoSourceToken>video_source</VideoSourceToken>
      <ImagingSettings>
        <Brightness xmlns="http://www.onvif.org/ver10/schema">%s</Brightness>
        <ColorSaturation xmlns="http://www.onvif.org/ver10/schema">%s</ColorSaturation>
        <Contrast xmlns="http://www.onvif.org/ver10/schema">%s</Contrast>
      </ImagingSettings>
      <ForcePersistence>true</ForcePersistence>
    </SetImagingSettings>
  </s:Body>
</s:Envelope>